Tekla Open API Reference for Tekla Structures 2025
TeklaProgressBar.Value Property
Gets or sets the current position of the progress bar.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int Value { get; set; }
Public Property Value As Integer
	Get
	Set
Property Value
Type: Int32
Remarks
The value should be a number between 0 and 100.
See Also
Reference
TeklaProgressBar Class
Tekla.Structures.Dialog Namespace